[
  {
    "url": "https://www.morgan.edu",
    "content": "Are you ready to embark on a journey of knowledge, growth and endless possibilities? Look no further than  , your path to receiving a world-class education and a brighter future. News \t \r\n \t \r\n \t \r\n \t \r\n \r\n                     \r\n                 Innovative Programs In preparation for the workforce demands of today and the careers of tomorrow, Morgan offers more than 140 academic degree programs for traditional and nontraditional students. \r\n                                     \r\n                                 This Week @ Morgan \r\n                 \r\n             Research at Morgan Maryland’s Preeminent Public Urban Research University engages in the pursuit of discovery, innovation and solutions that improve and impact lives. \r\n                                     \r\n                                 The National Treasure \"Growing The Future, Leading The World\" 1700 East Cold Spring Lane Baltimore, Maryland 21251 443-885-3333 \r\n\t \r\n                                         \r\n\t \r\n                                         \r\n\t \r\n                             ©\r\n \r\nMorgan State University"
  },
  {
    "url": "https://www.morgan.edu/computer-science/research",
    "content": "Department of Computer Science Research Research Areas Dr. Shuangbao (Paul) Wang, professor and chair of the Department of Computer Science, presented as a keynote speaker at the International Conference on Cryptography, Security, and Privacy (ICCSP) in Nanjing, China. His talk, \"Optimizing Quantum Circuits in Speeding up Breaking the RSA,\" presents a break-through approach toward defeating RSA encryption using quantum algorithms. As a Carnegie-classified R2 \"high research activity\" doctoral institution, Morgan State University has stepped into the forefront of research in quantum mechanics, quantum algorithms, quantum cryptology, and quantum cryptography. The Computer Science Department is helping lead the University's efforts to advance the science of quantum computing and cybersecurity. Dr. Monir Sharker is a panel member of Sports Analytics Curricula at HBCUs: Building a STEM Talent and Career Development Pipeline at 2019 Annual HBCU Conference. Dr. Rahman has received the 2017 Faculty Award for \"Excellence in Research\" from SCMNS for his outstanding performances in Grantsmanship, Publications, Presentations in national and international conferences, mentoring of both Graduate and Undergraduate students and several outreach activities with Google, Facebook, and Apple. Dr. Dillon. NIH. Assessing the Effectiveness of Virtual In-Person Peer-Motivation Smoking Cessation Interventions for Youths and Adults. $1,422,456 for five years. 2019. Dr. Dillon. NSF. Infusing Learning Initiatives for Improving the Programming Proficiency of Computer Science Majors at Morgan State University. $150,000 for one year. 2019. A Morgan ASCEND PILOT Research grant ($47,416), entitled \"Developing a Retrieval Based Diagnostic Aid for Automated Melanoma Recognition,\" is awarded to Dr. Mahmudur Rahman to conduct research for developing a Diagnostic Aid for Melanoma detection by using Image Processing, Computer Vision, and Machine Learning techniques. A three-year, $367,488 grant will support a \"Targeted Infusion\" project to research \"Infusing Computational Thinking and Visual Learning into an Introductory Computer Science Course to Promote Students' Success and Retention.\" Mahmudur Rahman, Ph.D., an SCMNS assistant professor of computer science, will lead the research efforts on this project. Dr. Prabir Bhattacharya is a Co-PI in this grant. Dr. Rahman of SCMNS also received a separate three-year Research Initiation Award in the amount of $297,843 to study \"Integrating Image and Text Information for Biomedical Literature-based Cross and Multimodal Retrieval\". To conduct a study on \"Real World-relevant Security Labware for Mobile Threat Analysis and Protection Experience,\" a research grant was awarded in the amount of $80,650. Prabir Bhattacharya is the Principal Investigator leading this two-year project. Professor Prabir Bhattacharya is a fellow of IEEE (Institute for Electrical and Electric Engineers), a fellow of AAAS (American Association for the Advancement of Science) and also a fellow at IAPR (International Association for Pattern Recognition). Dr. Vojislav Stojkovic was awarded a grant on Distributed Processing of Big Data for Military Applications Amount: $100,000 Fund Agency: AHPCRC, Stanford University Dr. Shuangbao (Paul) Wang McMechen Hall Suite 507 Phone: (443) 885-4503 Fax: (443) 885-8213 Ms. Wendy Smith McMechen Hall Suite 507 Phone:(443) 885-3962 Fax: (443) 885-8213 Ms. Grace Steele McMechen 507 Phone: (443) 885-1053 Dr. Shuangbao (Paul) Wang McMechen Hall Suite 507 Phone: (443) 885-4503 Fax: (443) 885-8213 Ms. Wendy Smith McMechen Hall Suite 507 Phone:(443) 885-3962 Fax: (443) 885-8213 Ms. Grace Steele McMechen 507 Phone: (443) 885-1053 1700 East Cold Spring Lane Baltimore, Maryland 21251 443-885-3333 \r\n\t \r\n                                         \r\n\t \r\n                                         \r\n\t \r\n                             ©\r\n \r\nMorgan State University"
  },
  {
    "url": "https://www.morgan.edu/computer-science/faculty-and-staff/shuangbao-wang",
    "content": "\r\n     \t\r\n\r\n             \r\n                                                 \r\n\r\n                                     Shuangbao \"Paul\" Wang \r\n                                             Office: \t \r\n\r\n                                             \r\n                                                                                     Phone: \t \r\n\r\n                                             \r\n                                                                                     \r\n\r\n                                     \r\n                                            \t \r\n\r\n                                         Paul Wang is a Professor and the Chairperson of Computer Science at Morgan State University. He is a LINK Fellow and has held positions as the TSYS Endowed Chair in Cybersecurity by a $5 million endorsement, Director of Center for Security Studies with more than 3,000 cyber students, and Chief Information and Technology Officer (CIO/CTO) of the National Biomedical Research Foundation. He has been a consultant to many companies and serving on multiple boards and government and private sector technology committees. Paul was directly involved in drafting of the National Initiatives of Cybersecurity Education (NICE) framework. His research areas are quantum crypto, secure architecture, AI/ML, IoT/CPS, and video indexing. In teaching, one of his students appeared in Time Magazine for doing his class project which he continued to pursue and later became an entrepreneur. Paul has extensive experiences working with students especially underrepresented minorities and track records in mentoring students to excel in learning and entering into the workplace. In addition to books, refereed publications, conference speakers and numeral grant activities including recent grants from NSF, NSA, Apple, and Microsoft, Paul has four patents; three of them have been licensed to the industry. Paul Wang received his Ph.D. under Dr. Robert Ledley, the inventor of body CT scanner in 2004. He completed postdoc studies in quantum computing at MIT following a renowned scholar Peter Shor and in AI and data science at University of Cambridge.   Secure architecture, AI/ML, quantum cryptoanalysis, IoT/CPS, and video indexing. Dr. Shuangbao (Paul) Wang McMechen Hall Suite 507 Phone: (443) 885-4503 Fax: (443) 885-8213 Ms. Wendy Smith McMechen Hall Suite 507 Phone:(443) 885-3962 Fax: (443) 885-8213 Ms. Grace Steele McMechen 507 Phone: (443) 885-1053 Dr. Shuangbao (Paul) Wang McMechen Hall Suite 507 Phone: (443) 885-4503 Fax: (443) 885-8213 Ms. Wendy Smith McMechen Hall Suite 507 Phone:(443) 885-3962 Fax: (443) 885-8213 Ms. Grace Steele McMechen 507 Phone: (443) 885-1053 1700 East Cold Spring Lane Baltimore, Maryland 21251 443-885-3333 \r\n\t \r\n                                         \r\n\t \r\n                                         \r\n\t \r\n                             ©\r\n \r\nMorgan State University"
  },
  {
    "url": "https://www.morgan.edu/computer-science/current-students/sacs",
    "content": "Department of Computer Science The Society for the Advancement of Computer Science The computer science club is informally known as SACS (The Society for the Advancement of Computer Science). It was founded in 1964 and managed by Ms. Cynthia Harvey. The primary participants were members who were enrolled in other majors (like Mathematics, and Business), but who assisted in teaching Computer Science courses at the time that the club was founded. In 1976, SACS became a student affiliate of the Association for Computing Machinery (ACM). On campus (and in our tax forms), we are recognized as Association for Computing Machinery-Morgan State University (ACM-MSU), but we retain the SACS name as a homage to our beginnings. The SACS name is also useful because it helps the alumni identify us for activities such as Homecoming. Ms. Harvey was the advisor from 1964 to 1999. Ms. Sheila Wiggins was the advisor from 1999 to 2011, and Dr. Schinnel Small assumed the position of advisor when Ms. Wiggins retired in 2011. Our most popular event is the alumni reception, which is hosted every year at Homecoming to connect with alumni. Last year we celebrated 50 years of existence! The goal of the club was to promote the Computer Science major, develop camaraderie among CS and other STEM majors and promote concepts in CS as part of everyday activities. Please join the group on Facebook: Please contact us via email: The current members of the executive board are as follows: President - Daniel Nnaji Vice President - Derrell Carter Treasurer - Brandon Bronson Secretary (Corresponding) - Elizabeth Owolabi Secretary (Recording) - Adeoye Owolabi Webmaster - Schuyler Clark Our primary goals (other than increasing membership!) are to: 1) Assist with tutoring in Computer Science courses 2) Develop activities that utilize CS concepts (e.g. apps) 3) Community outreach (we have partnered with V-Linc for volunteer activities in the past. V-Linc is an organization at customizes everyday items for people with disabilities. For more info, check out www.vlinc.org) Dr. Shuangbao (Paul) Wang McMechen Hall Suite 507 Phone: (443) 885-4503 Fax: (443) 885-8213 Ms. Wendy Smith McMechen Hall Suite 507 Phone:(443) 885-3962 Fax: (443) 885-8213 Ms. Grace Steele McMechen 507 Phone: (443) 885-1053 Dr. Shuangbao (Paul) Wang McMechen Hall Suite 507 Phone: (443) 885-4503 Fax: (443) 885-8213 Ms. Wendy Smith McMechen Hall Suite 507 Phone:(443) 885-3962 Fax: (443) 885-8213 Ms. Grace Steele McMechen 507 Phone: (443) 885-1053 1700 East Cold Spring Lane Baltimore, Maryland 21251 443-885-3333 \r\n\t \r\n                                         \r\n\t \r\n                                         \r\n\t \r\n                             ©\r\n \r\nMorgan State University"
  },
  {
    "url": "https://www.morgan.edu/computer-science/degrees-and-programs/ms_advancedcomputing",
    "content": "Department of Computer Science M.S. in Advanced Computing M.S. in Advanced Computing (Online/Onsite) The MS in Advanced Computing program preserves the core of Computer Science (CS) while possessing unique strength in emerging interdisciplinary areas in  ,  ,   and  . The program is delivered in both online and face-to-face formats. For online learning participates, students take ten courses and can complete the degree program in a 12-month period. Students can also choose to work on a project or conduct research and then write a thesis under the guidance of the CS faculty. This new program is designed for students who have recently completed a bachelor's degree program in Computer Science or a related field and wish to enhance their career, explore research opportunities in Computer Science, and apply their acquired skills in multi-disciplinary teams or for specific focus. The program also meets the needs of students who are already in the workforce and wish to update or improve their knowledge of current computer science. 1 Elective course 1 Project (3 credits) A suggested   can be found here. A full list of the courses and descriptions can be found on the university's academic catalogs. To apply, please visit   website. If you have questions, please contact the program director. You are welcome to contact the Graduate Program Director,   if you have any questions. We look forward to hearing from you! Inclusion and diversity is the core value for the CS department and Morgan State University. International students are warmly welcomed here. We will all benefit from your presence and your willingness to share your life, culture, and experiences with us. Dr. Shuangbao (Paul) Wang McMechen Hall Suite 507 Phone: (443) 885-4503 Fax: (443) 885-8213 Ms. Wendy Smith McMechen Hall Suite 507 Phone:(443) 885-3962 Fax: (443) 885-8213 Ms. Grace Steele McMechen 507 Phone: (443) 885-1053 Dr. Shuangbao (Paul) Wang McMechen Hall Suite 507 Phone: (443) 885-4503 Fax: (443) 885-8213 Ms. Wendy Smith McMechen Hall Suite 507 Phone:(443) 885-3962 Fax: (443) 885-8213 Ms. Grace Steele McMechen 507 Phone: (443) 885-1053 1700 East Cold Spring Lane Baltimore, Maryland 21251 443-885-3333 \r\n\t \r\n                                         \r\n\t \r\n                                         \r\n\t \r\n                             ©\r\n \r\nMorgan State University"
  },
  {
    "url": "https://www.morgan.edu/computer-science/current-students",
    "content": "Department of Computer Science Current Students Class Schedules The department offers BS in Computer Science program with focus on software engineering, cybersecurity, AI/ML, data science, and game design. The department also offers BS in Cloud Computing program, MS in Advanced Computing program, and MS in Bioinformatics program. A Ph.D. in Advanced Computing program is being proposed and is expectecd to launch in Spring 2024.  Forms The department no longer uses paper forms. The following forms can be filed directly online. COSC Course Registration   Request Form [spring registration has ended]. COSC Internal Course   Requests           - Contact your   to submit the request for you.            - Form location (faculty only): smart sheet               - Core courses cannot be substituted. Requests for approcals are not always granted. COSC Adviser/faculty Recommendation Request Form [ ] COSC Action Conference Request Form [ ]  [https://www.morgan.edu/registrar/forms] Excess Credits (>18) Request Form Change Catelog Request Form  Enrollment/Degree Verification Request Form  Time Confilct Request Form and more... Student Highlights Highlights of students' achievements in academic, research, innovation, and internships. . Check the most up-to-date activities on CS Twitter:  SACS SACS (The Society of the Advancement of Computer Science) is a computer science club that was founded in 1964. . Advisers Your advisers should appear on your DegreeWork. You can also  . Internship Opportunities The department has collaborations with Google, Facebook, JP Morgan Chase, NASA, NSA, Lockheed Martin, and many other public and private organizations to provide internships and other opportunities for students. . For most up-to-date information, please check out on CS Twitter:  Catalogs You can download the recent catalogs below. Please note that the catalog may be updated when necessary. Contact your academic adviser (see above) if you have questions. Dr. Shuangbao (Paul) Wang McMechen Hall Suite 507 Phone: (443) 885-4503 Fax: (443) 885-8213 Ms. Wendy Smith McMechen Hall Suite 507 Phone:(443) 885-3962 Fax: (443) 885-8213 Ms. Grace Steele McMechen 507 Phone: (443) 885-1053 Dr. Shuangbao (Paul) Wang McMechen Hall Suite 507 Phone: (443) 885-4503 Fax: (443) 885-8213 Ms. Wendy Smith McMechen Hall Suite 507 Phone:(443) 885-3962 Fax: (443) 885-8213 Ms. Grace Steele McMechen 507 Phone: (443) 885-1053 1700 East Cold Spring Lane Baltimore, Maryland 21251 443-885-3333 \r\n\t \r\n                                         \r\n\t \r\n                                         \r\n\t \r\n                             ©\r\n \r\nMorgan State University"
  },
  {
    "url": "https://www.morgan.edu/computer-science/faculty-and-staff",
    "content": "Department of Computer Science Faculty and Staff Professor and Chair Professor, Associate Chair Professor Associate Professor Assistant Professor Assistant Professor Professor, Associate Dean for Research and Graduate Programs Professor of Practice Associate Professor Assistant Professor Research Assistant Professor Assistant Professor Coordinator of the MS in Bioinformatics Program, Professor of Practice Associate Professor Associate Professor Assistant Professor Associate Professor Lecturer Lecturer Research Associate Google Engineer in Residence Administrative Assistant Dr. Shuangbao (Paul) Wang McMechen Hall Suite 507 Phone: (443) 885-4503 Fax: (443) 885-8213 Ms. Wendy Smith McMechen Hall Suite 507 Phone:(443) 885-3962 Fax: (443) 885-8213 Ms. Grace Steele McMechen 507 Phone: (443) 885-1053 Dr. Shuangbao (Paul) Wang McMechen Hall Suite 507 Phone: (443) 885-4503 Fax: (443) 885-8213 Ms. Wendy Smith McMechen Hall Suite 507 Phone:(443) 885-3962 Fax: (443) 885-8213 Ms. Grace Steele McMechen 507 Phone: (443) 885-1053 1700 East Cold Spring Lane Baltimore, Maryland 21251 443-885-3333 \r\n\t \r\n                                         \r\n\t \r\n                                         \r\n\t \r\n                             ©\r\n \r\nMorgan State University"
  },
  {
    "url": "https://www.morgan.edu/computer-science/degrees-and-programs/phd_advcomputing",
    "content": "Department of Computer Science PhD in Advanced and Equitable Computing Ph.D. in Advanced and Equitable Computing  The Advanced and Equitable Computing doctoral program covers emerging areas in Computer Science. It seeks to enhance research capacity and apply advanced computing approaches to solve real world problems. This Ph.D. program, both theoretical and applied, is a natural extension of the Master of Science (MS) in Advanced Computing degree program in the CS Department with one of the fastest growth. The program is a unique Advanced Computing doctoral program focusing on new and on demand frontiers on quantum cryptography, Cybersecurity, and equitable, emotional, responsible, resilient, and empathic AI/ML. To apply, please visit website. If you have questions, please contact the program director. You are welcome to contact the PhD Program Director Dr.   for general questions and support. For adviser and financial support, please contact the faculty directly. We look forward to hearing from you. Inclusion and diversity is the core value for the CS department and Morgan State University. International students are warmly welcomed here. We will all benefit from your presence and your willingness to share your life, culture, and experiences with us. Dr. Shuangbao (Paul) Wang McMechen Hall Suite 507 Phone: (443) 885-4503 Fax: (443) 885-8213 Ms. Wendy Smith McMechen Hall Suite 507 Phone:(443) 885-3962 Fax: (443) 885-8213 Ms. Grace Steele McMechen 507 Phone: (443) 885-1053 Dr. Shuangbao (Paul) Wang McMechen Hall Suite 507 Phone: (443) 885-4503 Fax: (443) 885-8213 Ms. Wendy Smith McMechen Hall Suite 507 Phone:(443) 885-3962 Fax: (443) 885-8213 Ms. Grace Steele McMechen 507 Phone: (443) 885-1053 1700 East Cold Spring Lane Baltimore, Maryland 21251 443-885-3333 \r\n\t \r\n                                         \r\n\t \r\n                                         \r\n\t \r\n                             ©\r\n \r\nMorgan State University"
  },
  {
    "url": "https://www.morgan.edu/computer-science/admission-and-application",
    "content": "Department of Computer Science Admission & Application Here at the department of Computer Science, we try to provide the best possible education for our students, both undergraduate and graduate. We believe that applying to Morgan Computer Science will be one of the best decisions that you make. We also believe in you! How to Apply for Bachelor of Science (B.S.) in Computer Science and B.C. in Cloud Computing You may get all the necessary information about applying to Morgan from the by clicking . Or you may start your application process by clicking . For further assistant, please do not hesitate to contact the Dr. Guobin Xu Email:  Phone: (443) 885-3371 Dr. Radhouane Chouichane Email: How to Apply for Master of Science (M.S.) in Advanced Computing To learn all about the application requirements and process, please visit  . You may start your application for the Master of Science (M.S.) in Advanced Computing by visiting School of Graduate Studies website . Dr. Eric Sakk Email: Phone: 443-885-3270 How to Apply for Doctor of Philosophy (Ph.D.) in Advanced Computing To learn all about the application requirements and process, please visit  . You may start your application for the Ph.D. in Advanced Computing by visiting School of Graduate Studies website . Dr. Md Rahman Email: Phone: 443-885-3962 How to Apply for Master of Science (M.S.) in Bioinformatics To learn all about the application requirements and process, please visit . You may start your application for the Master of Science (M.S.) in Bioinformatics by visiting School of Graduate Studies website . :  Dr. Roshan Paudel.  Email: Phone: 443-885-3096 Dr. Shuangbao (Paul) Wang McMechen Hall Suite 507 Phone: (443) 885-4503 Fax: (443) 885-8213 Ms. Wendy Smith McMechen Hall Suite 507 Phone:(443) 885-3962 Fax: (443) 885-8213 Ms. Grace Steele McMechen 507 Phone: (443) 885-1053 Dr. Shuangbao (Paul) Wang McMechen Hall Suite 507 Phone: (443) 885-4503 Fax: (443) 885-8213 Ms. Wendy Smith McMechen Hall Suite 507 Phone:(443) 885-3962 Fax: (443) 885-8213 Ms. Grace Steele McMechen 507 Phone: (443) 885-1053 1700 East Cold Spring Lane Baltimore, Maryland 21251 443-885-3333 \r\n\t \r\n                                         \r\n\t \r\n                                         \r\n\t \r\n                             ©\r\n \r\nMorgan State University"
  },
  {
    "url": "https://www.morgan.edu/computer-science/current-students/internship-opportunities",
    "content": "Department of Computer Science Internship Opportunities For more information, visit . Follow to Apply.  Tech Exchange, a student exchange program between Google and 10 Historically Black Colleges and Universities (HBCUs) and Hispanic-Serving Institutions (HSIs), hosts students at Google's Mountain View campus and engages them in a variety of applied computer science courses. The curriculum includes machine learning, product management, Theory of Computation and database systems, all co-taught by HBCU/HSI faculty and Google engineers. Due: Sep. 11, 2019 Career Day: October 16, 2019 10:00 - 3:00 pm. Hill Field House . Work with a the Coaction Lab for interdisciplinary research at UMaine, the Openlab Research Group at UC Santa Cruz and Alliance Data / Epsilon in Silicon Valley to help create an interactive app system for the Oceanic Scales art and science puzzle system dedicated to the exploration of phytoplankton as a subject for art science research. We are looking for talented programmers, app developers, and Unity animator's / game developers to assist with the creation of a new education based app for elementary and middle school students. Experience with Augmented Reality systems, gaming or Ipad app dev and HTML 5 is a plus. Specifically, we need people with experience working with Unity both to continue the development of the app framework / UI and to animate and help design unique touch screen interactions. PROJECT WEBSITE: This internship was made possible with funding from the Maine EPSCoR Please contact Gene Felice ( ) if you have any questions or are interested in the internship. Please see . Send resumes to Tanaisha Brisbon at using attached INROADS template by Thursday Nov 10th at 5pm. The U.S. Department of Homeland Security (DHS) Science and Technology Directorate Office of University Programs sponsors a 10-week summer internship program for students majoring in homeland security related science, technology, engineering and mathematics (HS-STEM) disciplines. The program provides students with quality research experiences at federal research facilities located across the country and allows students the opportunity to establish connections with DHS professionals. It is open to undergraduate and graduate students in a broad spectrum of HS-STEM disciplines and DHS mission-relevant Research Areas. Undergraduate students receive a $6,000 stipend plus travel expenses. Graduate students receive a $7,000 stipend plus travel expenses. 10-week research experiences are offered at: Coast Guard Research and Development Center ● Customs and Borders Protection ● Engineer Research and Development Center ● Federal Emergency Management Agency ● Immigration and Customs Enforcement, Health Service Corps ● National Security Technologies ● National Urban Security Technology Laboratory ● Naval Research Laboratory ● Office for Interoperabilty and Compatibility ● Transportation Security Laboratory ● DOE National Laboratories: Argonne, Berkeley, Idaho, Livermore, Los Alamos, Oak Ridge, Pacific Northwest, and Sandia Areas of research: Engineering, computer science, mathematics, physics, chemistry, biological / life sciences, environmental science, emergency and incident management, social sciences, and more. U.S. citizenship required. December 7, 2016, 11:59PM EST Applications and supporting materials must be submitted at Detailed information about the internships can be found at   Clemson University paid 8 weeks summer REU:Clemson University invites undergraduates from all disciplines to apply for a paid 8 weeks summer REU (Research Experience for Undergraduates) program in Visualization. Program Dates: June 5 - July 28, 2017 Link to REU Application: The program identifies research collaborators with visualization needs and assigns each student to a REU team. Each REU Team consists of a research/science collaborator, a visualization mentor and a visualization REU student. This arrangement fosters collaboration among team members, an appreciation of the visualization process and an understanding of the role visualization plays in discovery and analysis. Research areas of this site include: computer science, genetics and biochemistry, geophysics, sociology, molecular modeling and simulation, inorganic chemistry, social media, parks recreation tourism management, biological sciences, digital humanities and much more. Students will participate in activities as a member of their REU Team, their Research Lab, and their REU cohort thereby creating a rich, multidisciplinary research experience that will include enrichment lectures, excursions and social events. In addition to the exposure to cutting edge research, students selected to participate will receive a travel stipend for one round trip to and from Clemson, a housing allowance, a stipend to cover living expenses and access to research faculty and cyberinfrastructure resources to help facilitate their success in the program. This REU Site is sponsored by NSF ACI Grant No. 1359223 and is being directed and coordinated by Dr Wole Oyekoya. Please feel free to forward this email. Wole Oyekoya, PhD Director of Visualization Clemson Computing and Information Technology (CCIT) Clemson University JHU/APL is currently seeking full-time students with a strong academic record for our APL Technology Leadership Scholars (ATLAS) Internship Program. The ATLAS Internship Program is offered to well-qualified, highly motivated undergraduate and graduate students attending Historically Black Colleges and Universities (HBCUs), Hispanic-Serving Institutions (HSIs), and Minority Institutions (MIs) who have an interest in applied scientific research. This highly competitive 10 - 12 week paid summer internship program focuses on building technical and leadership skills that will uniquely prepare students for careers in science and engineering.  . Dr. Shuangbao (Paul) Wang McMechen Hall Suite 507 Phone: (443) 885-4503 Fax: (443) 885-8213 Ms. Wendy Smith McMechen Hall Suite 507 Phone:(443) 885-3962 Fax: (443) 885-8213 Ms. Grace Steele McMechen 507 Phone: (443) 885-1053 Dr. Shuangbao (Paul) Wang McMechen Hall Suite 507 Phone: (443) 885-4503 Fax: (443) 885-8213 Ms. Wendy Smith McMechen Hall Suite 507 Phone:(443) 885-3962 Fax: (443) 885-8213 Ms. Grace Steele McMechen 507 Phone: (443) 885-1053 1700 East Cold Spring Lane Baltimore, Maryland 21251 443-885-3333 \r\n\t \r\n                                         \r\n\t \r\n                                         \r\n\t \r\n                             ©\r\n \r\nMorgan State University"
  },
  {
    "url": "https://www.morgan.edu/academics",
    "content": "Academics \t \r\n Finding a major that is the right fit places you one step closer to making your dreams a reality. \t \r\n It is our mission to advance the education of students who have excelled at the baccalaureate and/or master's level and to prepare them for their future. \t \r\n Creating transformative opportunities that advance knowledge, foster learning, and engage urban communities. \r\n Schools & Colleges \t \r\n \r\nThe Library provides resources and services to sustain learning, teaching, research, service, cultural and extra-curricular enrichment.  \t \r\n \r\nThis your pathway to flexibility and convenience while still offering the excellence and opportunity for achievement found in traditional classroom-based courses. \t \r\n \r\nConnecting with an academic advisor is important to your college success! And we're here to help. Morgan Completes You! Ready to finish your degree? Complete The Journey! 18 Bachelor’s and Graduate Degree Programs Affordable Tuition -- Online Classes, Flexible Course Schedules, Personal Academic Support, Scholarships Available, Transfer Credits Accepted \r\n                                     \r\n                                 Student Success and Retention \r\n                             Center for Academic Success and Achievement \r\n                             University Convocation \r\n                             Commencement at Morgan State University is a festive and joyous occasion at which family and guests are welcome to celebrate the accomplishments of the graduating class.  1700 East Cold Spring Lane Baltimore, Maryland 21251 443-885-3333 \r\n\t \r\n                                         \r\n\t \r\n                                         \r\n\t \r\n                             ©\r\n \r\nMorgan State University"
  },
  {
    "url": "https://www.morgan.edu/computer-science/degrees-and-programs",
    "content": "Department of Computer Science Degrees & Programs Offerings The department of Computer Science offers: The Bachelor of Science (B.S.) in Computer Science The undergraduate program in Computer Science prepares students for entry into the computing profession, for graduate study in computer, computational, and data sciences, and for the many challenges that will confront them in their professional and personal life. The Computer Science program also prepares students to apply their knowledge and training to produce solutions to specific and esoteric problems. Students learn to define the problem clearly; to determine its tractability; to determine when consultation with outside experts is appropriate; to evaluate and choose an appropriate solution strategy; and then to study, specify, design, implement, test, modify, and document that solution; to evaluate alternatives and perform risk analysis on that design; to integrate alternative techniques and technologies into that solution; and finally to communicate that solution to colleagues, to professionals in other fields, and to the general public. Key to all of this is the ability of the problem-solver to work within a team environment throughout the entire problem-solving process. . The Master of Science (M.S.) in Advanced Computing (Online/Onsite) The MS in Advanced Computing program preserves the core of Computer Science (CS) while possessing unique strength in emerging interdisaplinary areas in Cybersecurity, Artificial Intelligence, Data Science and Cloud Computing. The program is delivered in both online and face-to-face formats. For online learning participates, students take ten courses and can complete the degree program in a 12-month period. Students can also choose to work on a project or conduct research and then write a thesis under the guidance of the CS faculty. . The Doctor of Philosophy (Ph.D.) in Advanced and Equitable Computing The Ph.D. program covers emerging areas of Computer Science including (but not limited to) Quantum Cryptography, Algorithms, Computing, Cybersecurity, AI/ML, Data Analytics, and challenges, resolutions and innovations in emotional, empathic, reliable, governable, traceable, resilient and responsible computing, and in the soon to be quantum age and the post-quantum age. The program can be taken on campus or fully remote/online. The Bachelor of Science (B.S.) in Cloud Computing (Online/Onsite) The BS in Cloud Computing instructional program is being offered online as well as in a traditional classroom setting (face-to-face), providing innovative, inclusive, hands-on, workforce-oriented, and distinctive educational experiences to a broad cross-section of the population, including adult learners and other nontraditional students. The program is designed for students to gain knowledge in cloud computing , develop skills in cloud computing services and applications, have careers in cloud computing within industry, academia, and government as cloud administrators, architects, modelers, engineers, application developers, security specialists, analytics specialists, analysts, and researchers. There will be 12 cloud computing required courses (36 credits) 4 math, and the elective courses. The total major requirements consist of 22 courses (70 credits) and the Program consists of a total of 39 courses (120 credit). The full list of courses with description will be available soon. . The MS in Bioinformatics  The M.S. in Bioinformatics curriculum offers coursework in computational biology methods, programming, and biostatistics. The Program’s electives offer students the flexibility to specialize and build broader knowledge in both the life sciences and computer sciences. Upon completion of the degree, graduates will have a solid, experience-based foundation to gain a competitive edge in this highly rewarding, high-demand field. Dr. Shuangbao (Paul) Wang McMechen Hall Suite 507 Phone: (443) 885-4503 Fax: (443) 885-8213 Ms. Wendy Smith McMechen Hall Suite 507 Phone:(443) 885-3962 Fax: (443) 885-8213 Ms. Grace Steele McMechen 507 Phone: (443) 885-1053 Dr. Shuangbao (Paul) Wang McMechen Hall Suite 507 Phone: (443) 885-4503 Fax: (443) 885-8213 Ms. Wendy Smith McMechen Hall Suite 507 Phone:(443) 885-3962 Fax: (443) 885-8213 Ms. Grace Steele McMechen 507 Phone: (443) 885-1053 1700 East Cold Spring Lane Baltimore, Maryland 21251 443-885-3333 \r\n\t \r\n                                         \r\n\t \r\n                                         \r\n\t \r\n                             ©\r\n \r\nMorgan State University"
  },
  {
    "url": "https://www.morgan.edu/about",
    "content": "About Morgan State Welcome to Morgan State University! Morgan State University, founded in 1867, is a Carnegie-classified   institution providing instruction to a multiethnic, multiracial, multinational student body and offering more than 140 academic programs leading to degrees from the baccalaureate to the doctorate. As Maryland's  , Morgan fulfills its mission to address the needs and challenges of the modern urban environment through intense community-level study and pioneering solutions.  Anchored in a charming residential area of northeast Baltimore, the breadth of Morgan’s expansive campus encompasses more than 185 acres extending beyond its sprawling campus proper which features state-of-the-art facilities geared toward innovative teaching and learning in the 21st century. The only university to have its entire campus,   by the National Trust for Historic Preservation, offers a safe and inviting learning environment with easy access to  : culture, exhibits, dining, shopping, activities, sightseeing and employment. The off-campus opportunities also extend to community projects and civic engagement.    Morgan has graduated more than 55,000 degree candidates since its establishment more than 150 years ago, producing a passionately   who have found success in all areas of endeavor, in the U.S. and beyond. Among the nation's most diverse Historically Black Colleges and Universities, and the largest in Maryland, Morgan seeks to ensure that the doors of higher education are opened as wide as possible to as many as possible. \r\n Schools & Colleges 1700 East Cold Spring Lane Baltimore, Maryland 21251 443-885-3333 \r\n\t \r\n                                         \r\n\t \r\n                                         \r\n\t \r\n                             ©\r\n \r\nMorgan State University"
  },
  {
    "url": "https://www.morgan.edu/research",
    "content": "\r\n                        Research\r\n                     \r\n                        Our focus is on promoting excellence in research and scholarship.  Our faculty, staff, and students engage in creative and collaborative research opportunities to engage and enhance our community at large.\r\n                     \r\n                                 \r\n                             The Pathway to R1  sits down for a candid conversation on Morgan's momentum and how its transformative force permeates all aspects of the University — particularly in the realm of Research and MSU's quest to attain R1 high research status. President Wilson shares insights on the impact of Morgan becoming an R1 research institution, its benefits to the greater community of Baltimore and State of Maryland, as well as setting a path forward to R1 classification.   Research at Morgan \t \r\n Morgan's Cross-School Research Centers and Programs are important interdisciplinary efforts that address research and manufacturing challenges too complex for single-discipline programs. \t \r\n It is our responsibility and honor to cultivate student success through innovative approaches to enhancing undergraduate research \t \r\n The division works with the deans, department chairs, and principal investigators to develop and support institutional and cross-disciplinary research initiatives. Center for Cybersecurity Assurance & Policy Providing knowledge, methodology, solutions, and skilled cybersecurity engineers to help prevent penetration and manipulation of our nation’s cyber physical infrastructures. \r\n                                     \r\n                                 RESOURCES Research & Innovation \t \r\n \t \r\n \t \r\n \t \r\n \r\n                     \r\n                 1700 East Cold Spring Lane Baltimore, Maryland 21251 443-885-3333 \r\n\t \r\n                                         \r\n\t \r\n                                         \r\n\t \r\n                             ©\r\n \r\nMorgan State University"
  },
  {
    "url": "https://www.morgan.edu/scmns/computerscience",
    "content": "Department of Computer Science The Computer Science Program provides students with fundamental computer science knowledge and training, and prepares them to apply their knowledge and training to produce solutions to specific problems. Students learn to define a problem clearly, determine its feasibility and choose an appropriate solution strategy. The solution strategy will study, specify, design, implement, test, modify, and document the solution. As part of the solution strategy, students will learn to evaluate alternative designs, perform risk analysis on alternative designs, and finally, communicate solutions to colleagues and other professionals. A key element to all of this is the ability of the student to work and collaborate within a team environment throughout the entire problem-solving process. The Computer Science Curriculum has a set of core courses designed to accomplish two primary objectives:   Bachelor of Computer Science degree students learning outcomes: For Master's and Ph.D. Programs, please visit the [ ] for Details. We are dedicated to preparing students to be the next generation of scientists and professionals who will be able to compete effectively in the changing global society. Dr. Shuangbao (Paul) Wang McMechen Hall Suite 507 Phone: (443) 885-4503 Fax: (443) 885-8213 Ms. Wendy Smith McMechen Hall Suite 507 Phone:(443) 885-3962 Fax: (443) 885-8213 Ms. Grace Steele McMechen 507 Phone: (443) 885-1053 Dr. Shuangbao (Paul) Wang McMechen Hall Suite 507 Phone: (443) 885-4503 Fax: (443) 885-8213 Ms. Wendy Smith McMechen Hall Suite 507 Phone:(443) 885-3962 Fax: (443) 885-8213 Ms. Grace Steele McMechen 507 Phone: (443) 885-1053 1700 East Cold Spring Lane Baltimore, Maryland 21251 443-885-3333 \r\n\t \r\n                                         \r\n\t \r\n                                         \r\n\t \r\n                             ©\r\n \r\nMorgan State University"
  },
  {
    "url": "https://www.morgan.edu/undergradadmissions",
    "content": "Office of Undergraduate Admission & Recruitment Where will your Morgan journey take you? Start here. \t \r\n We are proud and excited to welcome you to a community of scholars ready to change the world!  \t \r\n The Undergraduate Admissions Office has established an alumni corps who assists with recruitment activities throughout the country and abroad. \t \r\n Learn all about our requirements for admission to apply with confidence. \t \r\n Here at Morgan, it is our mission to offer undergraduate programs in a comprehensive range of disciplines. \t \r\n Self-Help Portal:  Morgan's One-Stop for Student Services \t \r\n Learn more about applying for Institutional Financial Assistance. 1700 East Cold Spring Lane Tyler Hall, Suite 111 Baltimore, Maryland 21251 1700 East Cold Spring Lane Baltimore, Maryland 21251 443-885-3333 \r\n\t \r\n                                         \r\n\t \r\n                                         \r\n\t \r\n                             ©\r\n \r\nMorgan State University"
  }
]
